## **NumPyå­¦ä¹ ç¬”è®°1**â­
Pandaså«æœ‰ä½¿æ•°æ®åˆ†æå·¥ä½œå˜å¾—æ›´å¿«æ›´ç®€å•çš„é«˜çº§æ•°æ®ç»“æ„å’Œæ“ä½œå·¥å…·ã€‚  
PandasåŸºäºNumPyæ„å»ºï¼Œè®©ä»¥NumPyä¸ºä¸­å¿ƒçš„åº”ç”¨å˜å¾—æ›´åŠ ç®€å•ã€‚

1. Pandasæ•°æ®ç»“æ„
   
2. ç´¢å¼•å¯¹è±¡

In [16]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### <1.Pandasæ•°æ®ç»“æ„>
Pandasçš„ä¸¤ä¸ªä¸»è¦æ•°æ®ç»“æ„æ˜¯ï¼šSerieså’ŒDataFrameã€‚

#### ğŸ§©Serise
Seriesæ˜¯ä¸€ç§ç±»ä¼¼äºä¸€ç»´æ•°ç»„çš„å¯¹è±¡ï¼Œ  
å®ƒç”±ä¸€ç»„æ•°æ®ï¼ˆå„ç§NumPyæ•°æ®ç±»å‹ï¼‰ä»¥åŠä¸€ç»„ä¸ä¹‹ç›¸å…³çš„æ•°æ®ç´¢å¼•ç»„æˆã€‚

##### 1.Seriseçš„æ„å»º

In [17]:
# Seriesçš„å­—ç¬¦ä¸²è¡¨ç°å½¢å¼ä¸ºï¼šç´¢å¼•åœ¨å·¦è¾¹ï¼Œå€¼åœ¨å³è¾¹ã€‚
# ç”±äºæˆ‘ä»¬æ²¡æœ‰ä¸ºæ•°æ®æŒ‡å®šç´¢å¼•ï¼Œäºæ˜¯ä¼šè‡ªåŠ¨åˆ›å»ºä¸€ä¸ª0åˆ°N-1çš„æ•´æ•°ç´¢å¼•
obj1=Series([1,2,3,4])
obj1

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
# è·å–Seriesçš„valueså’Œindexå±æ€§
print(obj1.values)
print(obj1.index)

[1 2 3 4]
RangeIndex(start=0, stop=4, step=1)

In [19]:
# åˆ›å»ºSerieså¸¦æœ‰å¯ä»¥å¯¹å„ä¸ªæ•°æ®ç‚¹è¿›è¡Œæ ‡è®°çš„ç´¢å¼•
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [20]:
print(obj2.values)
print(obj2.index)

[ 4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')

##### 2.é€šè¿‡Pythonå­—å…¸åˆ›å»ºSerise

In [21]:
# ä¼ å…¥Pythonå­—å…¸ï¼ŒåŸå­—å…¸çš„é”®æˆä¸ºSeriesçš„ç´¢å¼•
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
# sdataä¸­è·Ÿstatesç´¢å¼•é¡¹åŒ¹é…çš„å€¼ä¼šè¢«æ‰¾å‡ºæ¥å¹¶æ”¾åˆ°ç›¸åº”çš„ä½ç½®ä¸Š
sindex = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=sindex)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
# åˆ¤æ–­æ˜¯å¦ä¸ºç©º
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
# Seriesè‡ªåŠ¨å¯¹é½
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

##### 3.Seriesçš„nameå±æ€§

In [25]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

##### 4.ä¿®æ”¹Seriesçš„ç´¢å¼•

In [26]:
obj1.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj1

Bob      1
Steve    2
Jeff     3
Ryan     4
dtype: int64

#### ğŸ§©DataFrame
DataFrameæ˜¯ä¸€ä¸ªè¡¨æ ¼å‹çš„æ•°æ®ç»“æ„ï¼Œå®ƒå«æœ‰ä¸€ç»„æœ‰åºçš„åˆ—ï¼Œæ¯åˆ—å¯ä»¥æ˜¯ä¸åŒçš„å€¼ç±»å‹ã€‚  
DataFrameæ—¢æœ‰è¡Œç´¢å¼•ä¹Ÿæœ‰åˆ—ç´¢å¼•ï¼Œå®ƒå¯ä»¥è¢«çœ‹åšç”±Seriesç»„æˆçš„å­—å…¸(å…±ç”¨åŒä¸€ä¸ªç´¢å¼•)ã€‚

##### 1.DataFrameçš„æ„å»º
æœ€å¸¸ç”¨æ˜¯ç›´æ¥ä¼ å…¥ä¸€ä¸ªç”±ç­‰é•¿åˆ—è¡¨æˆ–NumPyæ•°ç»„ç»„æˆçš„å­—å…¸ã€‚

In [27]:
# DataFrameä¼šè‡ªåŠ¨åŠ ä¸Šç´¢å¼•ï¼Œä¸”å…¨éƒ¨è¢«æœ‰åºæ’åˆ—
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame1 = DataFrame(data)
frame1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [28]:
# å¦‚æœæŒ‡å®šåˆ—åºåˆ—ï¼Œåˆ™DataFrameçš„åˆ—å°±ä¼šæŒ‰ç…§æŒ‡å®šé¡ºåºè¿›è¡Œæ’åˆ—
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [29]:
# å¦‚æœä¼ å…¥çš„åˆ—åœ¨æ•°æ®ä¸­æ‰¾ä¸åˆ°ï¼Œå°±ä¼šäº§ç”ŸNAå€¼
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
         index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

##### 2.DataFrameçš„è¡Œåˆ—æ“ä½œ
é€šè¿‡ç±»ä¼¼å­—å…¸æ ‡è®°çš„æ–¹å¼æˆ–å±æ€§çš„æ–¹å¼ï¼Œå¯ä»¥å°†DataFrameçš„åˆ—è·å–ä¸ºä¸€ä¸ªSeriesã€‚

In [30]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [38]:
# ç¬¬ä¸€è¡Œæ•°æ®
frame2.iloc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [41]:
# ä¿®æ”¹å’§
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [42]:
# å°†åˆ—è¡¨æˆ–æ•°ç»„èµ‹å€¼ç»™æŸä¸ªåˆ—æ—¶ï¼Œå…¶é•¿åº¦å¿…é¡»è·ŸDataFrameçš„é•¿åº¦ç›¸åŒ¹é…ã€‚
# å¦‚æœèµ‹å€¼çš„æ˜¯ä¸€ä¸ªSeriesï¼Œå°±ä¼šç²¾ç¡®åŒ¹é…DataFrameçš„ç´¢å¼•ã€‚
frame2['debt'] = [1, 2, 3, 4, 5]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
five   2002  Nevada  2.9     5

In [43]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [44]:
# ä¸ºä¸å­˜åœ¨çš„åˆ—èµ‹å€¼ä¼šåˆ›å»ºå‡ºä¸€ä¸ªæ–°åˆ—
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [45]:
# åˆ é™¤å’§
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

##### 3.DataFrameåµŒå¥—å­—å…¸
å¦‚æœæ•°æ®å½¢å¼æ˜¯åµŒå¥—å­—å…¸ï¼ˆå­—å…¸çš„å­—å…¸ï¼‰ï¼Œå°†å®ƒä¼ ç»™DataFrameï¼Œå®ƒä¼šè¢«è§£é‡Šä¸ºï¼š  
å¤–å±‚çš„é”®ä½œä¸ºåˆ—ï¼Œå†…å±‚çš„é”®åˆ™ä½œä¸ºè¡Œç´¢å¼•ã€‚

In [46]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [47]:
# å¯¹ç»“æœè¿›è¡Œè½¬ç½®
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

ğŸ””å¯ä»¥è¾“å…¥ç»™DataFrameæ„é€ å™¨çš„æ•°æ®ï¼š

- äºŒç»´ndarrayï¼š æ•°æ®çŸ©é˜µ
- ç”±æ•°ç»„ã€åˆ—è¡¨æˆ–å…ƒç»„ç»„æˆçš„å­—å…¸ï¼š æ¯ä¸ªåºåˆ—ä¼šå˜æˆDataFrameçš„ä¸€åˆ—ã€‚æ‰€æœ‰åºåˆ—çš„é•¿åº¦å¿…é¡»ç›¸åŒ
- NumPyçš„ç»“æ„åŒ–/è®°å½•æ•°ç»„ï¼š ç±»ä¼¼äº æœ‰æ•°ç»„ç»„æˆçš„å­—å…¸
- ç”±Seriesç»„æˆçš„å­—å…¸
- ç”±å­—å…¸ç»„æˆçš„å­—å…¸
- å­—å…¸æˆ–Seriesçš„åˆ—è¡¨
- ç”±åˆ—è¡¨æˆ–å…ƒç»„ç»„æˆçš„åˆ—è¡¨
- å¦ä¸€ä¸ªDataFrame
- NumPyçš„MaskedArray

##### 4.DataFrameçš„å±æ€§

In [48]:
# è®¾ç½®DataFrameçš„indexå’Œcolumnsçš„nameå±æ€§ï¼Œå¹¶æ˜¾ç¤ºå‡ºæ¥
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [49]:
# DataFrameçš„valueså±æ€§ä¼šä»¥äºŒç»´ndarrayçš„å½¢å¼è¿”å›DataFrameä¸­çš„æ•°æ®
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

### <2.ç´¢å¼•å¯¹è±¡>
pandasçš„ç´¢å¼•å¯¹è±¡è´Ÿè´£è½´æ ‡ç­¾å’Œå…¶ä»–å…ƒæ•°æ®(æ¯”å¦‚è½´åç§°ç­‰)ã€‚  
æ„å»ºSeriesæˆ–DataFrameæ—¶ï¼Œ æ‰€ç”¨åˆ°çš„ä»»ä½•æ•°ç»„æˆ–å…¶ä»–åºåˆ—çš„æ ‡ç­¾éƒ½ä¼šè¢«è½¬æ¢æˆä¸€ä¸ªIndexã€‚

In [50]:
obj = Series(range(3), index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [51]:
index[1:]

Index(['b', 'c'], dtype='object')